import random

print("7-3.  20173087 노원진\n")
print("###########################")
print("#    오늘의    수학문제   #")
print("###########################")

M = [f"514 * 516 = {514*516}", f"876 - 123 = {876-123}", f"1 + 2 = {1+2}", f"30 / 6 = {30/6}",f"40 - 10 = {40-10}",
     f"9368 * 432 = {9368*432}",f"4887 / 32 = {4887/32}", f"39305 * 23 = {39305*23}",f"1234 + 9876 = {1234+9876}", f"76983 - 2487 = {76983-2487}"]
i = 1
chocielsit = random.choice(M)

while True:
    print(f"문제{i} . {chocielsit}" )
    i = i + 1
    a = int(input("마치려면 -1, 계속하려면 1 : "))
    if a == -1 :
        print("종료합니다.")
        break
    elif a == 1:
        continue
    else:
        print("다시 입력을 해주세요.")
    